# Students: Yuying Zhou, Xirong Cao

In [1]:
%load_ext sql

# Q1: Create Database lab2.db3

In [2]:
%%sql 
create database lab2.db3

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [3]:
%sql sqlite:///lab2.db3

'Connected: @lab2.db3'

# Q2: Create three tables and insert data

In [34]:
# Sailors

In [4]:
%%sql drop table if exists Sailors;
create table Sailors(sid int primary key,sname varchar(20),rating varchar(5),age int);
insert into Sailors values(1,'david','4',22);
insert into Sailors values(2,'jojo','5',26);
insert into Sailors values(3,'jason','3',31);
insert into Sailors values(4,'kelly','5',27);
insert into Sailors values(5,'arno','2',36);
insert into Sailors values(6,'lisa','1',23);

 * sqlite:///lab2.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [17]:
# Boats

In [5]:
%%sql drop table if exists Boats;
create table Boats(bid int primary key,name varchar(15),color varchar(15));
insert into Boats values(101,'sheep','red');
insert into Boats values(106,'cow','blue');
insert into Boats values(110,'chicken','yellow');
insert into Boats values(111,'horse','blue');
insert into Boats values(103,'duck','yellow');
insert into Boats values(112,'pig','white');
insert into Boats values(107,'fish','red');

 * sqlite:///lab2.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [19]:
# Reserves

In [6]:
%%sql drop table if exists Reserves;
create table Reserves(sid int,bid int,day date,primary key(sid,bid,day));
insert into Reserves values(1,101,'03-20-2022');
insert into Reserves values(1,106,'04-26-2022');
insert into Reserves values(2,110,'05-02-2022');
insert into Reserves values(3,103,'03-26-2022');
insert into Reserves values(4,112,'04-10-2022');
insert into Reserves values(2,111,'04-17-2022');
insert into Reserves values(2,111,'04-08-2022');
insert into Reserves values(5,107,'04-25-2022');
insert into Reserves values(6,111,'03-28-2022');
insert into Reserves values(4,101,'04-12-2022');
insert into Reserves values(3,112,'04-05-2022');
insert into Reserves values(5,111,'03-23-2022');

 * sqlite:///lab2.db3
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [22]:
# display three tables

In [7]:
%%sql 
select * from sailors

 * sqlite:///lab2.db3
Done.

[(1, 'david', '4', 22),
 (2, 'jojo', '5', 26),
 (3, 'jason', '3', 31),
 (4, 'kelly', '5', 27),
 (5, 'arno', '2', 36),
 (6, 'lisa', '1', 23)]

In [8]:
%%sql 
select * from boats

 * sqlite:///lab2.db3
Done.

[(101, 'sheep', 'red'),
 (106, 'cow', 'blue'),
 (110, 'chicken', 'yellow'),
 (111, 'horse', 'blue'),
 (103, 'duck', 'yellow'),
 (112, 'pig', 'white'),
 (107, 'fish', 'red')]

In [9]:
%%sql
select * from reserves

 * sqlite:///lab2.db3
Done.

[(1, 101, '03-20-2022'),
 (1, 106, '04-26-2022'),
 (2, 110, '05-02-2022'),
 (3, 103, '03-26-2022'),
 (4, 112, '04-10-2022'),
 (2, 111, '04-17-2022'),
 (2, 111, '04-08-2022'),
 (5, 107, '04-25-2022'),
 (6, 111, '03-28-2022'),
 (4, 101, '04-12-2022'),
 (3, 112, '04-05-2022'),
 (5, 111, '03-23-2022')]

# Q3: Find names of sailors who've reserved boat #110

In [10]:
%%sql
select sname
from Sailors,Reserves
where Sailors.sid=Reserves.sid
and Reserves.bid=110

 * sqlite:///lab2.db3
Done.

[('jojo',)]

# Q4: Find names of sailors who've reserved a red boat

In [11]:
%%sql
select sname
from Sailors,Reserves,Boats
where Sailors.sid=Reserves.sid
and Reserves.bid=Boats.bid
and Boats.color='red'

 * sqlite:///lab2.db3
Done.

[('david',), ('arno',), ('kelly',)]

# Q5: Find names of sailors who've reserved a red or blue boat

In [12]:
%%sql
select distinct sname
from Sailors,Reserves,Boats
where Sailors.sid=Reserves.sid
and Reserves.bid=Boats.bid
and (Boats.color='red'or Boats.color='blue')

 * sqlite:///lab2.db3
Done.

[('david',), ('jojo',), ('arno',), ('lisa',), ('kelly',)]

# Q6: Find names of sailors who've reserved a red and a blue boat (nested query)

In [13]:
%%sql
select sname
from Sailors,Reserves,Boats
where Sailors.sid=Reserves.sid
and Reserves.bid=Boats.bid
and Boats.color='red'
intersect
select sname
from Sailors,Reserves,Boats
where Sailors.sid=Reserves.sid
and Reserves.bid=Boats.bid
and Boats.color='blue'

 * sqlite:///lab2.db3
Done.

[('arno',), ('david',)]

# Q7: Find names of sailors who've reserved only blue boats

In [14]:
%%sql
select sname
from Sailors,Reserves,Boats
where Sailors.sid=Reserves.sid
and Reserves.bid=Boats.bid
and Boats.color='blue'
except
select sname
from Sailors,Reserves,Boats
where Sailors.sid=Reserves.sid
and Reserves.bid=Boats.bid
and Boats.color<>'blue'

 * sqlite:///lab2.db3
Done.

[('lisa',)]

# Q8: Find the average age of sailors for each rating level that has at least two sailors

In [15]:
%%sql
select rating,avg(age)as average_age
from Sailors
group by rating
having count(*)>1

 * sqlite:///lab2.db3
Done.

[('5', 26.5)]

# Q9: Find the average number boats reserved by each sailor

In [16]:
%%sql
select avg(num)
from(select Sailors.sid,sname,count(Reserves.bid) as num
from Reserves,Sailors
where Reserves.sid=Sailors.sid
group by Sailors.sid)

 * sqlite:///lab2.db3
Done.

[(2.0,)]

In [33]:
# possible solution as well

In [17]:
%%sql
select sname, num/6.0 from (
select Sailors.sid,sname,count(Reserves.bid) as num
from Reserves,Sailors
where Reserves.sid=Sailors.sid
group by Sailors.sid
)

 * sqlite:///lab2.db3
Done.

[('david', 0.3333333333333333),
 ('jojo', 0.5),
 ('jason', 0.3333333333333333),
 ('kelly', 0.3333333333333333),
 ('arno', 0.3333333333333333),
 ('lisa', 0.16666666666666666)]

# Q10: Find the name of the boat that is most popular one (reserved the most)

In [18]:
%%sql
select boatName,popular from(
   select Boats.name as boatName,count(Reserves.bid) as popular
   from Reserves,Boats
   where Boats.bid=Reserves.bid
   group by Boats.bid
)
where popular=(
    select max(popular)from(
        select Boats.name as boatName,count(Reserves.bid) as popular
        from Reserves,Boats
        where Boats.bid=Reserves.bid
        group by Boats.bid)
)

 * sqlite:///lab2.db3
Done.

[('horse', 4)]